import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        /*
        문제
        카지노에서 제일 인기 있는 게임 블랙잭의 규칙은 상당히 쉽다. 카드의 합이 21을 넘지 않는 한도 내에서,
        카드의 합을 최대한 크게 만드는 게임이다. 블랙잭은 카지노마다 다양한 규정이 있다.

        한국 최고의 블랙잭 고수 김정인은 새로운 블랙잭 규칙을 만들어 상근, 창영이와 게임하려고 한다.

        김정인 버전의 블랙잭에서 각 카드에는 양의 정수가 쓰여 있다. 그 다음, 딜러는 N장의 카드를 모두 숫자가 보이도록 바닥에 놓는다.
         그런 후에 딜러는 숫자 M을 크게 외친다.

        이제 플레이어는 제한된 시간 안에 N장의 카드 중에서 3장의 카드를 골라야 한다.
        블랙잭 변형 게임이기 때문에, 플레이어가 고른 카드의 합은 M을 넘지 않으면서 M과 최대한 가깝게 만들어야 한다.

        N장의 카드에 써져 있는 숫자가 주어졌을 때, M을 넘지 않으면서 M에 최대한 가까운 카드 3장의 합을 구해 출력하시오.

        입력
        첫째 줄에 카드의 개수 N(3 ≤ N ≤ 100)과 M(10 ≤ M ≤ 300,000)이 주어진다.
        둘째 줄에는 카드에 쓰여 있는 수가 주어지며, 이 값은 100,000을 넘지 않는 양의 정수이다.

        합이 M을 넘지 않는 카드 3장을 찾을 수 있는 경우만 입력으로 주어진다.

        출력
        첫째 줄에 M을 넘지 않으면서 M에 최대한 가까운 카드 3장의 합을 출력한다.
        
        <<힌트>>
        3중 반복문을 사용하여 모든 가능한 3장의 카드 조합을 확인해볼 수 있습니다.
        각 조합의 합을 계산하고, 그 합이 M을 넘지 않으면서 지금까지 찾은 최대값보다 크다면 그 값을 새로운 최대값으로 저장합니다.
        변수를 하나 만들어 현재까지 찾은 가장 큰 합을 저장하고, 반복문이 끝나면 그 값을 출력합니다.
        시간 복잡도는 O(N^3)이 되지만, N이 최대 100이므로 충분히 시간 내에 해결할 수 있습니다.

         */

        Scanner sc = new Scanner(System.in);
        int N = sc.nextInt();
        int M = sc.nextInt();
        int[] nums = new int[N];
        int max = 0;
        for (int i = 0; i < N; i++) {
            nums[i] = sc.nextInt();
        }

        for (int i = 0; i < N-2; i++) {
            for (int j = i + 1; j < N-1; j++) {
                for (int k = j + 1; k < N; k++) {

                    int temp = nums[i] + nums[j] + nums[k];
                    if(temp > max && temp <= M) {
                        max = temp;
                    }
                }
            }
        }

        System.out.println(max);
    }
}
